const { Markup } = require('telegraf');

function getAdminMenu() {
    return Markup.keyboard([
        ['📸 ইনস্টা ম্যানেজমেন্ট', '📧 জিমেইল ম্যানেজমেন্ট'],
        ['📘 ফেসবুক ম্যানেজমেন্ট', '🐦 টুইটার (X) ম্যানেজমেন্ট'],
        ['💰 উইথড্র ম্যানেজমেন্ট', '💵 ইউজার ব্যালেন্স ম্যানেজমেন্ট'],
        ['👥 সকল ইউজার লিস্ট', '🏆 শীর্ষ রেফারেল লিস্ট'],
        ['🚫 ব্লক/আনব্লক ইউজার', '📢 অল ইউজার ব্রডকাস্ট'],
        ['✉️ সিঙ্গেল ইউজার মেসেজ', '🔙 ইউজার প্যানেল']
    ]).resize();
}

module.exports = { getAdminMenu };
